In [2]:
import pandas as pd

In [3]:
people={'first':['cin','anu','ais'],
       'middle':['de','de','en'],
       'last':['fu','en','fu'],
       'email':['cin@gamail.com','anu@gamail.com','aisha@gamail.com']}

In [4]:
df=pd.DataFrame(people)

In [5]:
df

  first middle last             email
0   cin     de   fu    cin@gamail.com
1   anu     de   en    anu@gamail.com
2   ais     en   fu  aisha@gamail.com

In [6]:
df.sort_values(by='last')

  first middle last             email
1   anu     de   en    anu@gamail.com
0   cin     de   fu    cin@gamail.com
2   ais     en   fu  aisha@gamail.com

In [7]:
#descending order want
df.sort_values(by='last',ascending=False)

  first middle last             email
0   cin     de   fu    cin@gamail.com
2   ais     en   fu  aisha@gamail.com
1   anu     de   en    anu@gamail.com

In [8]:
df.sort_values(by=['first','middle'],ascending=[True,False])   #to change ascending,descending at at a time in multiple coluns

  first middle last             email
2   ais     en   fu  aisha@gamail.com
1   anu     de   en    anu@gamail.com
0   cin     de   fu    cin@gamail.com

In [12]:
df.sort_values(by=['first','middle'],ascending=[True,False],inplace=True)
df

  first middle last             email
2   ais     en   fu  aisha@gamail.com
1   anu     de   en    anu@gamail.com
0   cin     de   fu    cin@gamail.com

In [15]:
df.sort_index() #to sort index value

  first middle last             email
0   cin     de   fu    cin@gamail.com
1   anu     de   en    anu@gamail.com
2   ais     en   fu  aisha@gamail.com

In [16]:
df['last'].sort_values()

1    en
2    fu
0    fu
Name: last, dtype: object